Repository: 4teamwork/ftw.tokenauth
Catalog: ftw/tokenauth/locales/*/LC_MESSAGES/ftw.tokenauth.po
Languages: de

source: Allowed IP range specification in <strong><a href="https://en.wikipedia.org/wiki/Classless_Inter-Domain_Routing#CIDR_notation">CIDR notation</a></strong>. Multiple comma-separated addresses / networks may be supplied.
de: Erlaubter IP-Range in <strong><a href="https://de.wikipedia.org/wiki/Classless_Inter-Domain_Routing#Beispiele">CIDR notation</a></strong>. Mehrere Adressen / Netzwerke können kommagetrennt angegeben werden.

source: Back
de: Zurück

source: Cancel
de: Abbrechen

source: Download Service Key
de: Service-Schlüssel herunterladen

source: Download your service key.
de: Laden Sie Ihren Service-Schlüssel herunter.

source: Edit
de: Bearbeiten

source: Edit Service Key
de: Service-Schlüssel bearbeiten

source: Edit cancelled
de: Bearbeiten abgebrochen

source: IP Address
de: IP-Adresse

source: Invalid IP range: ${ip_range_error}
de: Ungültiger IP-Range: ${ip_range_error}

source: Issue Service Key
de: Service-Schlüssel ausstellen

source: Issue a key to be used for authentication by a service application
de: Ausstellen eines Schlüssels zur Authentisierung einer Service-Applikation

source: Issue key
de: Schlüssel ausstellen

source: Issue new service key
de: Neuen Service-Schlüssel ausstellen

source: Issued
de: Ausgestellt

source: Key created: ${key_id}
de: Schlüssel ausgestellt: ${key_id}

source: Key creation cancelled.
de: Schlüssel-Erstellung abgebrochen.

source: Keys revoked.
de: Schlüssel gelöscht

source: Last Used
de: Zuletzt verwendet

source: Manage Service Keys
de: Service-Schlüssel verwalten

source: Recent uses of this key
de: Kürzliche Verwendungen dieses Schlüssels

source: Save
de: Speichern

source: Service Keys
de: Service-Schlüssel

source: The <strong>most recent</strong> use of a key is always displayed (whether or not it falls into that time window).
de: Die <strong>letzte</strong> Verwendung eines Schlüssels wird immer angezeigt (unabhängig davon, ob sie in diesem Zeitfenster stattfand oder nicht)

source: This is the <strong>only time</strong> your private key will be displayed - it will not be stored on the server, and can't be recovered should you fail to save it.
de: Dies ist das <strong>einzige Mal</strong> wo Ihr privater Schlüssel angezeigt wird - er wird nicht auf dem Server gespeichert, und kann nicht wiederhergestellt werden.

source: Time
de: Zeitpunkt

source: Title
de: Titel

source: Usage logs for key "${key_title}"
de: Logs zur Nutzung des Schlüssels "${key_title}"

source: Uses of this key to issue access tokens in the <strong>last ${retention_days} days</strong>.
de: Verwendungen dieses Schlüssels um Access Tokens auszustellen in den <strong>letzten ${retention_days} Tagen</strong>.

source: You should copy &amp; paste this key into a <tt>.json</tt> file, and store this file in a location accessible <strong>only to your service application</strong>. This key grants anyone in possession of it full access to this account. You should therefore make sure to protect it with the least file system permissions possible.
de: Speichern Sie diesen Schlüssel mittels Copy &amp; Paste in eine <tt>.json</tt> Datei, und sichern Sie diese Datei an einem Ort wo <strong>nur Ihre Service-Applikation</strong> Zugriff hat. Diese Schlüssel ermöglicht jedem, der im Besitz davon ist, vollständigen Zugriff auf diesen Account. Sie sollten ihn daher sorgfältig aufbewahren, und mit den minimal möglichen Berechtigungen auf dem Dateisystem versehen.

source: label_ip_range
de: IP-Range

source: label_issued
de: Ausgestellt

source: label_key_id
de: Schlüssel-ID

source: label_revoke_selected_keys
de: Ausgewählte Service-Schlüssel löschen

source: label_title
de: Titel

source: label_user_id
de: User-ID
